# -*- coding utf-8 -*-

#Задача на интервал и промежуток
a = int(input())
if (-15 < a <= 12) or (a == 16) or (a > 18):
    print(True)
else:
    print(False)